import 'dart:convert';

import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:webview_flutter/webview_flutter.dart';

class ViewBook extends StatefulWidget {
  final String name;
  final String content;

  const ViewBook({Key key, this.name, this.content}) : super(key: key);
  @override
  ViewBookState createState() {
    return ViewBookState();
  }
}
// body {font-size:40px;

//     padding: 10px 50px;
//     -webkit-column-gap: 115px;
//     -webkit-column-width: 575px;
//     text-align: justify;
//     text-justify: inter-character;

//     height: ${webViewHeight}px;
//     }
// h1   {color: blue;}
// p    {color: red;}
class ViewBookState extends State<ViewBook> {
  WebViewController _controller;
  int noOfPages;
  int currentPage = 1;
  double jumpPosition = 0;

  @override
  Widget build(BuildContext context) {
    double screenWidth = MediaQuery.of(context).size.width;
    double screenHeight = MediaQuery.of(context).size.height;
    double webViewHeight = screenHeight * 2.1;
    var webkitColumnWidth = 575;
    var webkitColumnGap = 115;
    var padding = "10px 50px";
    String html = widget.content;
    html = html.replaceFirst("{padding}", padding);
    html = html.replaceFirst("{webkitColumnGap}", webkitColumnGap.toString());

    html =
        html.replaceFirst("{webkitColumnWidth}", webkitColumnWidth.toString());
    html =
        html.replaceFirst("{webkitColumnWidth}", webkitColumnWidth.toString());
    html = html.replaceFirst("{justify}", "justify");
    html = html.replaceFirst("{textJustify}", "inter-character");
    html = html.replaceFirst("{webViewHeight}", webViewHeight.toString());

    html = html.replaceFirst("{h1FontSize}", "60");

    html = html.replaceFirst("{h3FontSize}", "50");
    html = html.replaceFirst("{pFontSize}", "40");

    //jumpPosition = jumpPosition + screenWidth / 2;
//     String html = '''
//   <!DOCTYPE html>
// <html>
// <head>
// <style>
// load of bullshit
// </style>
// </head>
// <body>

// <h1>২০২০ সালে লকডাউনের</h1>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p><p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p><p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p><p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// <p>২০২০ সালে লকডাউনের মধ্যেই একটা গুরুত্বপূর্ণ পদক্ষেপ নিয়েছিল কেন্দ্রের BJP সরকার— পরিবেশ সংক্রান্ত আমাদের দেশের দীর্ঘদিনের ভাবনাটাকেই নস্যাৎ করে দেওয়ার সরকারি বন্দোবস্ত করার জন্য ড্রাফ্ট্ EIA2020 পেশ করে!
// এ'নিয়ে সাধারণ মানুষের মতামত দেওয়ার সুযোগ সংকুচিত করার প্রতিবাদে বহু মানুষ ব্যক্তিগতভাবে এবং বিভিন্ন সংগঠনের মাধ্যমে আদালতের দারস্থ হন, যার পরিনতিতে ২০২০'র ১১ আগস্ট পর্যন্ত মতামত দেওয়ার সুযোগ পাওয়া যায় এবং বহু মানুষ (প্রায় ১৭ লক্ষ!) এই প্রশ্নে কার্যত কেন্দ্রীয় সরকারের বিরুদ্ধেই মতামত দেন।
// যদিও তারপর গোটা প্রক্রিয়ার ফলাফল সামনে আসে নি, অন্ততঃ আমার কাছে! আর, এই সময়েই ঘটে গেল গতকালের উত্তরাখন্ডের ভয়াবহ ঘটনাটা! </p>
// </body>
// </html>
//   ''';
    print(widget.content);
    return Scaffold(
      appBar: AppBar(
        title: Text(widget.name),
      ),
      body: GestureDetector(
        onHorizontalDragUpdate: (updateDetails) {},
        onDoubleTap: () {
          if (currentPage < noOfPages) {
            setState(() {
              currentPage++;
              jumpPosition = jumpPosition + screenWidth;
              _controller.scrollTo(jumpPosition.toInt(), 0);
            });
          }
        },
        child: WebView(
            initialUrl: 'about:blank',
            javascriptMode: JavascriptMode.unrestricted,
            onWebViewCreated: (WebViewController webViewController) {
              _controller = webViewController;
              _loadHtmlFromAssets(html);
            },
            onPageFinished: (some) async {
              double height = double.parse(await _controller.evaluateJavascript(
                  "document.documentElement.scrollHeight;"));
              //print("html height: " + height.toString());
              double htmlWidth = double.parse(await _controller
                  .evaluateJavascript("document.documentElement.scrollWidth;"));
              setState(() {
                noOfPages = htmlWidth ~/ (575 + 375);
              });
              _controller.scrollTo(0, 0);
            }),
      ),
      floatingActionButton: Text(
          "পৃষ্ঠা: " + currentPage.toString() + "/" + noOfPages.toString()),
    );
  }

  _loadHtmlFromAssets(html) async {
    _controller.loadUrl(Uri.dataFromString(html,
            mimeType: 'text/html', encoding: Encoding.getByName('utf-8'))
        .toString());
  }
}
